---
kind: type
id: T:Autodesk.Revit.DB.SpatialElementType
source: html/80080af1-a780-e983-a178-4fe889194275.htm
---
# Autodesk.Revit.DB.SpatialElementType

An enumerated type listing types of spaces.

## Syntax (C#)
```csharp
public enum SpatialElementType
```